#+title: Gist for steamvr setup


We need to modify the following setting files

#+BEGIN_SRC shell :results output
cat .steam/steam/config/steamvr.vrsettings
#+END_SRC

#+RESULTS:

#+begin_src ipython :session vrsetup :file  :exports both :tangle vrsetup.py
  import ast
  import json
  import os.path as path
  steam_dir = path.expanduser('~/.steam/steam')
  sf = path.join(steam_dir, 'config/steamvr.vrsettings')
  with open(sf, 'r') as f:
      cfg = json.load(f)

  cfg['steamvr']['forcedDriver'] = 'null'
  cfg['steamvr']['activateMultipleDrivers'] = True
  cfg['steamvr']['requireHmd'] = False
  cfg['dashboard']['enableDashboard'] = False
  if 'driver_null' in cfg:
      cfg.pop('driver_null')
  # driver_null = {                           #
  #     "enable": True,                       #
  #     "id": "Null Driver",                  #
  #     "serialNumber": "Null 4711",          #
  #     "modelNumber": "Null Model Number",   #
  #     "windowX": 100,                       #
  #     "windowY": 100,                       #
  #     "windowWidth": 1920,                  #
  #     "windowHeight": 1080,                 #
  #     "renderWidth": 1344,                  #
  #     "renderHeight": 1512,                 #
  #     "secondsFromVsyncToPhotons": 0.1,     #
  #     "displayFrequency": 90                #
  # }                                         #
  # cfg['driver_null'] = driver_null          #
  # cfg['power'] = {'powerOffOnExit' : False} #
  with open(sf, 'w') as f:
      cfg = json.dump(cfg, f, indent=4)

  sf = path.join(steam_dir, 'steamapps/common/SteamVR/drivers/null/resources/settings/default.vrsettings')
  with open(sf, 'r') as f:
      cfg = json.load(f)

  cfg['driver_null']['enable'] = True

  with open(sf, 'w') as f:
      cfg = json.dump(cfg, f, indent=4)
#+end_src

#+RESULTS:
: # Out[2]:

#+begin_src ipython :session vrsetup :file  :exports both
   #sf = path.join(steam_dir,
                  'steamapps/common/SteamVR/drivers/null/resources/settings/default.vrsettings')
   #with open(sf, 'r') as f:
   #    str_cfg = f.read()
   #    print(str_cfg)
   #    cfg = ast.literal_eval(str_cfg)

   #cfg['steamvr']['forcedDriver'] = 'null'
   #cfg['steamvr']['activateMultipleDrivers'] = True
   #cfg['steamvr']['requireHmd'] = False
   #print(cfg)
   #with open(sf, 'w') as f:
   #    cfg = json.dump(cfg, f, indent=4)
#+end_src

#+RESULTS:
: # Out[29]:
